[
    {
        "More than a million people in the UK are named after a Disney character": "https://www.mirror.co.uk/news/weird-news/more-million-people-uk-named-19939370"
    },
    {
        "Royal fan's throwback snap of Meghan shows what a difference three years makes": "More than a million people in the UK are named after a Disney character"
    },
    {
        "Mutant calf with 'human face' stuns farmers after it is born in Argentina": "https://www.mirror.co.uk/news/weird-news/mutant-calf-human-face-stuns-19926310"
    },
    {
        "Man in hysterics after bumping into doppelganger at friend's wedding": "https://www.mirror.co.uk/news/weird-news/man-hysterics-after-bumping-doppelganger-19914589"
    },
    {
        "Police advise people to not leave home without 'emergency bag' - and get called 'crass'": "https://www.mirror.co.uk/news/weird-news/man-hysterics-after-bumping-doppelganger-19914589"
    }
][
    ({
        "World leaders gathered in Paris for a final tribute to the fondly remembered former French president Jacques Chirac, who died last week at age 86. https://t.co/aWHsPTcG8M": "https://t.co/aWHsPTcG8M"
    },
    {
        "Morning briefing: Here's what you need to know to start your day https://t.co/rK5Pr3dRBq": "https://t.co/rK5Pr3dRBq"
    },
    {
        "Joe Biden's presidential campaign has cut back spending on online advertising so severely that he is now investing only a fraction of what his top rivals are on Facebook and Google https://t.co/kL4a2dV9qD": "https://t.co/kL4a2dV9qD"
    },
    {
        "After meddling in the 2016 American election, Russia is using similar tactics in the Central African Republic. But as it sows political chaos, this time it is also seeking diamonds. https://t.co/brfbfxxgxW": "https://t.co/brfbfxxgxW"
    },
    {
        "“Our tone must be prayerful, respectful, solemn, worthy of the Constitution,” Nancy Pelosi privately told her colleagues as Democrats planned more subpoenas, including to Rudy Giuliani https://t.co/tzIT3QoZGd": "https://t.co/tzIT3QoZGd"
    },
    {
        "Max Rose flipped a G.O.P. seat on Staten Island, which President Trump won by 16 points. His stance on impeachment could determine whether he keeps it. https://t.co/4XjUu1ym6O": "https://t.co/4XjUu1ym6O"
    },
    {
        "At the Santa Anita racetrack on Saturday, a 3-year-old colt named Emtech collapsed in the stretch with both his front legs broken and had to be euthanized. It was the 32nd horse fatality at the track since December. https://t.co/Wygdx229Y7": "https://t.co/Wygdx229Y7"
    },
    {
        "President Trump was repeatedly warned by his staff that the Ukraine conspiracy theory that he and his lawyer were pursuing was “completely debunked” long before the president pressed Ukraine to investigate his Democratic rivals, a former top adviser said https://t.co/5J3yXri92R": "https://t.co/5J3yXri92R"
    },
    {
        "A growing number of migrants, blocked at the border by new immigration policies, are using more dangerous tactics to reach the United States https://t.co/GKmzqUyBO1": "https://t.co/GKmzqUyBO1"
    },
    {
        "Nepal said embankments built by India along a shared border made flooding worse in their country during the summer monsoon season, killing dozens https://t.co/kLNEvCGQ5L": "https://t.co/kLNEvCGQ5L"
    },
    {
        "Forever 21 is filing for bankruptcy. The fast fashion retailer announced it will cease operations in 40 countries and close up to 178 stores in the US. https://t.co/ypmT7bIQBV": "https://t.co/ypmT7bIQBV"
    },
    {
        "A longtime personal bodyguard to two Saudi kings was shot and killed by a friend during a personal dispute, the Saudi state news media said on Sunday https://t.co/nemklX7626": "https://t.co/nemklX7626"
    },
    {
        "Babies aren't the only ones prone to throwing tantrums on planes, but now Japan Airlines will offer a guide for those fussy travelers looking to avoid their younger, at times more tearful counterparts https://t.co/ViKNKpIDZk": "https://t.co/ViKNKpIDZk"
    },
    {
        "4 inmates who are considered “extremely dangerous” escaped from a county jail in Ohio early Sunday morning after overpowering two guards, the authorities said https://t.co/uTvJdL7SO8": "https://t.co/uTvJdL7SO8"
    },
    {
        "He has been accused of inciting violence, misleading Queen Elizabeth II and running roughshod over the British Constitution. But for Britain's Prime Minister, Boris Johnson, the Conservative party conference is a safe space. https://t.co/FY7BSHUtaQ": "https://t.co/FY7BSHUtaQ"
    },
    {
        "Read @AOScott's review of Martin Scorsese’s latest film, \"The Irishman.\" It's a NYT Critic's Pick. https://t.co/PLHwoADtIj": "https://t.co/PLHwoADtIj"
    },
    {
        "RT @NYTmag: Our fall Voyages issue is here. Follow along as we take you to the extremities of the earth: https://t.co/JLUzaMeYQK https://t.…": "https://t.co/JLUzaMeYQK"
    },
    {
        "RT @nytimesbusiness: “We are going to develop that land,” said Mayor Nan Whaley of Dayton, Ohio. “We bought the land to develop it; that is…": "https://twitter.com"
    },
    {
        "Perhaps the most striking turn of 6ix9ine's testimony was the way his 2 lives — in public, one of the most promising new talents in hip-hop, and in private, part of a gang — remained distinct until they couldn't anymore, writes @JonCaramanica\nhttps://t.co/ELBq1Voc77": "https://t.co/ELBq1Voc77"
    },
    {
        "RT @bxchen: I wrote about the animated movie “Abominable” and its decision to cast Asian-Americans to voice Asian characters, which is a no…": "https://twitter.com"
    })
]
